ciaa/firmware_v1/externals/drivers/msp430/inc/msp430c091.h
#define A3DIV_0              (0x0000)  /* A-POOL Analog channel #3 voltage divider control: 0 */
#define A3DIV_1              (0x0010)  /* A-POOL Analog channel #3 voltage divider control: 1 */
#define A3DIV_2              (0x0020)  /* A-POOL Analog channel #3 voltage divider control: 2 */
#define A3DIV_3              (0x0030)  /* A-POOL Analog channel #3 voltage divider control: 3 */

#define CLKTRIM_0            (0x0000)  /* A-POOL Clock trimming: 0 */
#define CLKTRIM_1            (0x0400)  /* A-POOL Clock trimming: 1 */
#define CLKTRIM_2            (0x0800)  /* A-POOL Clock trimming: 2 */
#define CLKTRIM_3            (0x0C00)  /* A-POOL Clock trimming: 3 */

#define REFTRIM_0            (0x0000)  /* A-POOL Reference trimming: 0 */
#define REFTRIM_1            (0x1000)  /* A-POOL Reference trimming: 1 */
#define REFTRIM_2            (0x2000)  /* A-POOL Reference trimming: 2 */
#define REFTRIM_3            (0x3000)  /* A-POOL Reference trimming: 3 */
#define REFTRIM_4            (0x4000)  /* A-POOL Reference trimming: 4 */
#define REFTRIM_5            (0x5000)  /* A-POOL Reference trimming: 5 */
#define REFTRIM_6            (0x6000)  /* A-POOL Reference trimming: 6 */
#define REFTRIM_7            (0x7000)  /* A-POOL Reference trimming: 7 */


/* APTRIM Control Bits */
#define REFTSEL              (0x0001)  /* A-POOL Register bank used for the reference trimming */
#define REFTRIM0             (0x1000)  /* A-POOL Reference trimming bit: 0 */
#define REFTRIM1             (0x2000)  /* A-POOL Reference trimming bit: 1 */
#define REFTRIM2             (0x4000)  /* A-POOL Reference trimming bit: 2 */
#define REFTRIM3             (0x8000)  /* A-POOL Reference trimming bit: 3 */

/* APTRIM Control Bits */
#define REFTSEL_L           (0x0001)  /* A-POOL Register bank used for the reference trimming */

/* APTRIM Control Bits */
#define REFTRIM0_H          (0x0010)  /* A-POOL Reference trimming bit: 0 */
#define REFTRIM1_H          (0x0020)  /* A-POOL Reference trimming bit: 1 */
#define REFTRIM2_H          (0x0040)  /* A-POOL Reference trimming bit: 2 */
#define REFTRIM3_H          (0x0080)  /* A-POOL Reference trimming bit: 3 */

/* APOMR Control Bits */
#define CLKDIV0              (0x0001)  /* A-POOL Prescaler Control Bit: 0 */
#define CLKDIV1              (0x0002)  /* A-POOL Prescaler Control Bit: 1 */
#define CLKDIV2              (0x0004)  /* A-POOL Prescaler Control Bit: 2 */
#define SAREN                (0x0008)  /* A-POOL SAR conversion enable */
#define CTEN                 (0x0100)  /* A-POOL Continuous time mode of comparator */
#define AZCMP                (0x0200)  /* A-POOL Clocked zero compensated long term comparison */
#define AZSWREQ              (0x0400)  /* A-POOL SW request for Auto Zero Phase */
#define SVMINH               (0x0800)  /* A-POOL Suppress the generation of an SVM interrupt event. */

/* APOMR Control Bits */
#define CLKDIV0_L           (0x0001)  /* A-POOL Prescaler Control Bit: 0 */
#define CLKDIV1_L           (0x0002)  /* A-POOL Prescaler Control Bit: 1 */
#define CLKDIV2_L           (0x0004)  /* A-POOL Prescaler Control Bit: 2 */
#define SAREN_L             (0x0008)  /* A-POOL SAR conversion enable */

/* APOMR Control Bits */
#define CTEN_H              (0x0001)  /* A-POOL Continuous time mode of comparator */
#define AZCMP_H             (0x0002)  /* A-POOL Clocked zero compensated long term comparison */
#define AZSWREQ_H           (0x0004)  /* A-POOL SW request for Auto Zero Phase */
#define SVMINH_H            (0x0008)  /* A-POOL Suppress the generation of an SVM interrupt event. */

#define CLKDIV_0             (0x0000)  /* A-POOL Prescaler Control 0 : /1 */
#define CLKDIV_1             (0x0001)  /* A-POOL Prescaler Control 1 : /2 */
#define CLKDIV_2             (0x0002)  /* A-POOL Prescaler Control 2 : /4 */
#define CLKDIV_3             (0x0003)  /* A-POOL Prescaler Control 3 : /8 */
#define CLKDIV_4             (0x0004)  /* A-POOL Prescaler Control 4 : /16 */
#define CLKDIV_5             (0x0005)  /* A-POOL Prescaler Control 5 : /32 */
#define CLKDIV__1            (0x0000)  /* A-POOL Prescaler Control 0 : /1 */
#define CLKDIV__2            (0x0001)  /* A-POOL Prescaler Control 1 : /2 */
#define CLKDIV__4            (0x0002)  /* A-POOL Prescaler Control 2 : /4 */
#define CLKDIV__8            (0x0003)  /* A-POOL Prescaler Control 3 : /8 */
#define CLKDIV__16           (0x0004)  /* A-POOL Prescaler Control 4 : /16 */
#define CLKDIV__32           (0x0005)  /* A-POOL Prescaler Control 5 : /32 */


/* APIFG Control Bits */
#define EOCIFG               (0x0001)  /* A-POOL End of conversion interrupt flag */
#define CFIFG                (0x0002)  /* A-POOL Comparator falling edge interrupt flag */
#define CRIFG                (0x0004)  /* A-POOL Comparator rising edge interrupt flag */
#define REFOKIFG             (0x0008)  /* A-POOL Reference voltage ready interrupt flag */

/* APIFG Control Bits */
#define EOCIFG_L            (0x0001)  /* A-POOL End of conversion interrupt flag */
#define CFIFG_L             (0x0002)  /* A-POOL Comparator falling edge interrupt flag */
#define CRIFG_L             (0x0004)  /* A-POOL Comparator rising edge interrupt flag */
#define REFOKIFG_L          (0x0008)  /* A-POOL Reference voltage ready interrupt flag */


/* APIFG Control Bits */
#define EOCIE                (0x0001)  /* A-POOL End of conversion interrupt enable */
#define CFIE                 (0x0002)  /* A-POOL Comparator falling edge interrupt enable */
#define CRIE                 (0x0004)  /* A-POOL Comparator rising edge interrupt enable */
#define REFIKIE              (0x0008)  /* A-POOL Reference voltage ready interrupt enable */

/* APIFG Control Bits */
#define EOCIE_L             (0x0001)  /* A-POOL End of conversion interrupt enable */
#define CFIE_L              (0x0002)  /* A-POOL Comparator falling edge interrupt enable */
#define CRIE_L              (0x0004)  /* A-POOL Comparator rising edge interrupt enable */
#define REFIKIE_L           (0x0008)  /* A-POOL Reference voltage ready interrupt enable */


/* APIV Definitions */
#define APIV_NONE           (0x0000)    /* No Interrupt pending */
#define APIV_EOCIF          (0x0002)    /* EOCIFG */
#define APIV_CFIFG          (0x0004)    /* CFIFG */
#define APIV_CRIFG          (0x0006)    /* CRIFG */

/************************************************************
* COMPACT CLOCK SYSTEM
************************************************************/
#define __MSP430_HAS_CCS__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CCS__ 0x0160
#define CCS_BASE __MSP430_BASEADDRESS_CCS__

#define CCSCTL0_              0x0160    /* CCS Control Register 0 */
sfrb(CCSCTL0_L , CCSCTL0_);
sfrb(CCSCTL0_H , CCSCTL0_+1);
sfrw(CCSCTL0, CCSCTL0_);
#define CCSCTL1_              0x0162    /* CCS Control Register 1 */
sfrb(CCSCTL1_L , CCSCTL1_);
sfrb(CCSCTL1_H , CCSCTL1_+1);
sfrw(CCSCTL1, CCSCTL1_);
#define CCSCTL2_              0x0164    /* CCS Control Register 2 */
sfrb(CCSCTL2_L , CCSCTL2_);
sfrb(CCSCTL2_H , CCSCTL2_+1);
sfrw(CCSCTL2, CCSCTL2_);
#define CCSCTL4_              0x0168    /* CCS Control Register 4 */
sfrb(CCSCTL4_L , CCSCTL4_);
sfrb(CCSCTL4_H , CCSCTL4_+1);
sfrw(CCSCTL4, CCSCTL4_);
#define CCSCTL5_              0x016A    /* CCS Control Register 5 */
sfrb(CCSCTL5_L , CCSCTL5_);
sfrb(CCSCTL5_H , CCSCTL5_+1);
sfrw(CCSCTL5, CCSCTL5_);
#define CCSCTL6_              0x016C    /* CCS Control Register 6 */
sfrb(CCSCTL6_L , CCSCTL6_);
sfrb(CCSCTL6_H , CCSCTL6_+1);
sfrw(CCSCTL6, CCSCTL6_);
#define CCSCTL7_              0x016E    /* CCS Control Register 7 */
sfrb(CCSCTL7_L , CCSCTL7_);
sfrb(CCSCTL7_H , CCSCTL7_+1);
sfrw(CCSCTL7, CCSCTL7_);
#define CCSCTL8_              0x0170    /* CCS Control Register 8 */
sfrb(CCSCTL8_L , CCSCTL8_);
sfrb(CCSCTL8_H , CCSCTL8_+1);
sfrw(CCSCTL8, CCSCTL8_);

